public class Main {

    /*
    *   Ваш знакомый — владелец сети кинотеатров. В каждом принадлежащем ему
    кинотеатре есть несколько кинозалов, причем в каждом зале кресла могут
    быть расположены по-разному. Кроме того, различные залы имеют разное
    расписание сеансов. Чтобы не запутаться во всём этом, знакомый попросил
    вас написать для него программу, моделирующую работу кинотеатров. Такую
    программу называют «билетной системой». Программа должна предоставлять
    пользователю возможность вносить «в систему» всю необходимую
    справочную информацию: добавлять кинотеатр, добавлять зал в кинотеатр,
    задавать конфигурацию кресел, создавать сеанс определённого фильма (с
    определённой длительностью и в определённое время). Ну и самое главное:
    «система» должна уметь «продавать» билеты, отвечать на запросы о том, когда
    и где (в каком кинотеатре и зале) будет ближайший сеанс (на который есть
    свободные места) выбранного фильма, печатать для сеанса план зала с
    указанием занятых и свободных мест.

    Необходимо разработать консольный вариант программы, с полностью
    рабочим консольным интерфейсом. Вход реализовать как для администратора
    так и для пользователя. */
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}