public class FourthTask {

    /*Логистический максимин
    Ваша компания занимается грузоперевозками в Швейцарских Альпах. Вам
    нужно доставить груз из пункта A в пункт Z на большом грузовике. Из A в Z
    ведёт несколько дорог, каждая из которых проходит через несколько
    туннелей известной высоты. Выясните максимальную высоту, которую
    может иметь ваш грузовик.
    Формат ввода
    На первой строке вводится количество дорог.
    Затем для каждой дороги вводится (на отдельных строках) количество
    туннелей и высота каждого туннеля (точнее, максимально допустимая высота
            грузовика) в сантиметрах.
    Формат вывода
    Два целых числа: номер дороги (начиная нумерацию с единицы), по которой
    нужно проехать, чтобы высота грузовика была наибольшей, и сама эта
    высота.
            Гарантируется, что ответ однозначный.
            Пример
    Ввод Вывод
2
        3
        470
        430
        465
        2 450
    Ввод Вывод
2
        451
        450*/
}
