public class ThirdTask {

    /*Ищем клад
    Мы находимся на острове, на котором закопан клад. Мы находимся в точке с
    координатами (0, 0). Нам известно, где закопан клад, но этого мало: остров
    полон опасностей, и нужно перемещаться строго по указаниям карты,
    которая, к счастью, тоже имеется в нашем распоряжении. Мы хотим найти
    клад как можно скорее.
    Сначала вводятся два числа: координаты клада по оси икс (запад-восток) и
    игрек (юг-север). Затем следует некоторое количество указаний карты.
    Каждое указание карты состоит из двух строк. Первая строка содержит слово
«север», «юг», «запад» или «восток», вторая — натуральное число,
    количество шагов, которое нужно пройти в данном направлении.
    Заключительное указание карты состоит только из одной строки,
    содержащей слово «стоп».
    Программа выводит минимальное количество указаний карты, которое
    нужно выполнить, чтобы прийти к кладу. Гарантируется, что карта приводит
    к кладу.
    Формат ввода
    Два целых числа — координаты клада.
    Затем несколько блоков: строка (направление движения) и целое число
(количество шагов).
    Строка «стоп».
    Формат вывода
    Целое число — минимальное количество указаний карты, которое нужно
    выполнить, чтобы прийти к кладу.
    Пример
    Ввод Вывод
-2
        9
    север
9
    запад
2
    восток
17
    стоп*/
}
